[
  
  {
    "role": "IT Intern",
    "organisation": "Co-x3 Family Foundation",
    "startDate": "May 2024",
    "endDate": "Present",
    "experiences": [
      "Started a new summer Internship"
    ],
    "imageSrc": "history/cox3-removebg-preview.png"
  },

  {
    "role": "Networks Intern",
    "organisation": "MSU IT",
    "startDate": "May, 2024",
    "endDate": "Present",
    "experiences": 
    ["Zero Touch Provisioning, Updating/Installing Juniper switches/routers ", 
    "Documented network configurations and procedures resulting in a streamlined troubleshooting process and a 25% reduction in resolution time"],
    "imageSrc": "history/msuIT.png"
  },

  {
    "role": "Data Analytics Intern",
    "organisation": "Built by Blank",
    "startDate": "Jun, 2021",
    "endDate": "Oct 2021",
    "experiences": 
    ["Analyzed customer feedback data with Python, which resulted in identifying key areas for product improvement and a 15% increase in customer satisfaction.", 
    "Conducted market trend analysis using R, which resulted in identifying new business opportunities and contributing to a 10% increase in sales revenue."],
    "imageSrc": "history/builtByBlank.png"
  },
  
  {
    "role": "Research Assistant",
    "organisation": "MSU",
    "startDate": "Aug, 2022",
    "endDate": "Present",
    "experiences": [
      "Designed automation pipelines for speaker recognition and transcription using AWS and Python which resulted in a 40% increase in transcription accuracy and efficiency.",
      "Trained NLP machine learning models for Named Entity Recognition and Text Classification in Job descriptions using Python (spaCy, Pandas, json, Gensim), achieving a model accuracy of 96%.",
      "Implemented responsive websites using HTML, CSS, Next.js, and React.js for research projects, enhancing application performance by 30%."
    ],
    "imageSrc": "history/msuLogo.png"
  },

  {
    "role": "Teaching Assistant (Python)",
    "organisation": "MSU Eng.",
    "startDate": "Aug, 2023",
    "endDate": "Present",
    "experiences": [
      "Mentored and hosted over 700 students focusing on technical expertise and problem-solving skills in Python. Integrated professional use of GenAI model, Github Copilot",
      "Setup effective team coordination and communication with a team of 40 TAs for standardizing currciculum. Curate more than 7 Projects for skills development and data structure implementation."
    ],
    "imageSrc": "history/msuLogo.png"
  }

]
